"""
보림이는 엄마와 함께 놋데리아에 갔다.

보림이는 먹고 싶은게 많았으나 엄마가 살이 찐다고 2가지만 골라서 먹으라고 했다.

그리고 두 메뉴의 칼로리 합이 500보다 크면 엄마가 화를 내고, 500이하면 화를 내지 않는다.

보림이가 선택할 수 있는 메뉴는 다음과 같다.

1. 치즈버거 : 400 칼로리

2. 야채버거 : 340 칼로리

3. 우유 : 170 칼로리

4. 계란말이 : 100 칼로리

5. 샐러드 : 70 칼로리

이 메뉴들 중 2가지 메뉴를 선택했을 때 칼로리 합을 계산하고, 그 칼로리 합이 500보다 크면 "angry", 500이하면 "no angry"를 출력하시오.

입력
메뉴의 번호가 차례대로 두개 주어진다. (정수)

출력
그 번호의 메뉴 칼로리를 계산하여 500보다 크면 "angry", 500이하면 "no angry"를 출력하시오.
"""
a, b = map(int,input().split())
menu = [0,400,340,170,100,70]
if menu[a] + menu[b] > 500 :
    print("angry")
else:
    print("no angry")



